In [1]:
import pandas as pd
import numpy as np
import json
import matplotlib.pyplot as plt
import seaborn as sns

# Monthly Summary

In [2]:
loan_data = pd.read_json("dataset/loans.json")
loan_data.head(5)

,LoanGuid,LoanId,BorrowerFirstName,BorrowerLastName,SubjectAddress1,SubjectAddress2,SubjectCity,SubjectState,SubjectZip,SubjectAppraisedAmount,LoanAmount,InterestRate
0,f165ddb4-9788-43c1-89e9-24a720268dbf,43452,Anthony,Gonzalez,14613 E Philipot Path,None,Greenfield,OR,70547-5000,794914,730502,3.45
1,18d1c151-5655-4d45-a945-ac2c6917c149,43274,Ellie,Baker,8935 W Kitcat Terrace,None,Ashkum,AR,56727-1887,1272338,770080,2.04
2,d6f31e4e-1c5f-4f98-ab1e-935b3b69027c,47380,Hazel,Perez,751 E Arbutus Street,,Farmersville,NJ,75612-5890,607500,31148,3.78
3,29dccb60-2494-4f5f-a276-7692d4b0c192,12818,James,Jones,11532 S Bell Street,Apt. 62,Davis Junction,MN,56223-7304,983463,260164,2.86
4,51d3fbb9-6164-43c8-a139-1adbb44a1e73,59167,Caroline,Reed,5213 W Connaught Close,,Harvard,RI,83233-1854,1560498,808411,4.51

In [14]:
pd.options.display.float_format = '{:.2f}'.format

In [5]:
loan_data['SubjectState'].unique()

array(['OR', 'AR', 'NJ', 'MN', 'RI', 'MT', 'AK', 'NH', 'NC', 'SC', 'IN',
       'FL', 'UT', 'SD', 'PA', 'ND', 'CO', 'HI', 'TX', 'WY', 'NV', 'NY',
       'IA', 'KS', 'LA', 'CA', 'MA', 'TN', 'KY', 'ME', 'GA', 'MS', 'WV',
       'NM', 'AZ', 'VA', 'MO', 'DE', 'IL', 'NE', 'AL', 'MD', 'OK', 'VT',
       'WI', 'CT', 'ID', 'WA', 'OH', 'MI'], dtype=object)

In [15]:
column1 = ['LoanAmount', 'SubjectAppraisedAmount', 'InterestRate']
dataframe = loan_data['LoanAmount'].map("{:,.2f}".format)

Index(['LoanGuid', 'LoanId', 'BorrowerFirstName', 'BorrowerLastName',
       'SubjectAddress1', 'SubjectAddress2', 'SubjectCity', 'SubjectState',
       'SubjectZip', 'SubjectAppraisedAmount', 'LoanAmount', 'InterestRate'],
      dtype='object')

In [70]:
df = loan_data.agg({
    "LoanAmount":["sum", "average", "median", "min", "max"],
    "SubjectAppraisedAmount":["sum", "average", "median", "min", "max"],
    "InterestRate":["sum", "average", "median", "min", "max"],
})

In [98]:
df = df.rename(columns={'LoanAmount': 'LoanAmountSummary', 'SubjectAppraisedAmount': 'SubjectAppraisedAmountSummary', 'InterestRate':'InterestRateSummary'})

In [99]:
df

         LoanAmountSummary  SubjectAppraisedAmountSummary  InterestRateSummary
sum           504220272.00                  1004087165.00              3504.06
average          504220.27                     1004087.17                 3.50
median           501297.00                      999091.00                 3.52
min                  97.00                       43254.00                 2.00
max              999539.00                     1987010.00                 4.99

In [100]:
df.to_json(r'monthlySummary.json')

In [77]:
result = df.to_json(orient="columns")
parsed = json.loads(result)
json.dumps(parsed, indent=4)

'{\n    "LoanAmount": {\n        "sum": 504220272.0,\n        "average": 504220.272,\n        "median": 501297.0,\n        "min": 97.0,\n        "max": 999539.0\n    },\n    "SubjectAppraisedAmount": {\n        "sum": 1004087165.0,\n        "average": 1004087.165,\n        "median": 999091.0,\n        "min": 43254.0,\n        "max": 1987010.0\n    },\n    "InterestRate": {\n        "sum": 3504.06,\n        "average": 3.50406,\n        "median": 3.52,\n        "min": 2.0,\n        "max": 4.99\n    }\n}'

In [78]:
parsed

{'LoanAmount': {'sum': 504220272.0,
  'average': 504220.272,
  'median': 501297.0,
  'min': 97.0,
  'max': 999539.0},
 'SubjectAppraisedAmount': {'sum': 1004087165.0,
  'average': 1004087.165,
  'median': 999091.0,
  'min': 43254.0,
  'max': 1987010.0},
 'InterestRate': {'sum': 3504.06,
  'average': 3.50406,
  'median': 3.52,
  'min': 2.0,
  'max': 4.99}}

# Monthly State

In [48]:
text_file = open("monthlyByState.json", "w")

In [49]:
loan_data.columns

Index(['LoanGuid', 'LoanId', 'BorrowerFirstName', 'BorrowerLastName',
       'SubjectAddress1', 'SubjectAddress2', 'SubjectCity', 'SubjectState',
       'SubjectZip', 'SubjectAppraisedAmount', 'LoanAmount', 'InterestRate'],
      dtype='object')

In [50]:
columns_to_keep = ['SubjectState', 'SubjectAppraisedAmount', 'LoanAmount', 'InterestRate']

In [51]:
new_loan_data = loan_data[columns_to_keep]
new_loan_data.head(20)

   SubjectState  SubjectAppraisedAmount  LoanAmount  InterestRate
0            OR                  794914      730502          3.45
1            AR                 1272338      770080          2.04
2            NJ                  607500       31148          3.78
3            MN                  983463      260164          2.86
4            RI                 1560498      808411          4.51
5            MT                  781174      661555          2.52
6            AK                 1837890      851232          2.56
7            AK                  931241      636153          2.32
8            AK                 1086706      738413          2.41
9            NH                 1139367      829898          2.34
10           NC                  528093      363266          4.59
11           SC                  754163      442301          4.19
12           IN                 1307204      540820          3.81
13           OR                  590533      316631          4.61
14           FL                  946303      862390          3.78
15           UT                  943391      464399          3.74
16           SD                  617068      284198          2.91
17           PA                 1398250      636311          2.50
18           PA                  898845      487077          2.50
19           MT                  858844      243135          2.54

In [52]:
new_df = new_loan_data.groupby('SubjectState').agg({
    "LoanAmount": ["sum", "mean", "median", "min", "max"],
    "SubjectAppraisedAmount": ["sum", "mean", "median", "min", "max"],
    "InterestRate": ["sum", "mean", "median", "min", "max"],
})

In [53]:
new_df = new_df.rename(columns={'LoanAmount': 'LoanAmountSummary', 'SubjectAppraisedAmount': 'SubjectAppraisedAmountSummary', 'InterestRate':'InterestRateSummary'})

In [57]:
new_df.head(4)

             LoanAmountSummary                                     \
                           sum      mean    median    min     max
SubjectState
AK                    15907777 611837.58 736835.00   3849  994712
AL                     7394120 389164.21 333852.00  95078  956158
AR                     7715347 482209.19 449020.50  44185  909811
AZ                    12621426 525892.75 575965.50  30996  977859

             SubjectAppraisedAmountSummary                                \
                                       sum       mean     median     min
SubjectState
AK                                30104447 1157863.35 1092718.50  469916
AL                                17733573  933345.95 1064819.00  290953
AR                                15793049  987065.56 1051584.50  330901
AZ                                23839561  993315.04  965179.50  285356

                      InterestRateSummary
                  max                 sum mean median  min  max
SubjectState
AK            1926975               83.21 3.20   2.95 2.04 4.85
AL            1743768               70.03 3.69   3.81 2.03 4.84
AR            1566136               58.59 3.66   4.06 2.04 4.99
AZ            1921993               85.28 3.55   3.51 2.35 4.95

In [54]:
def nest(d: dict) -> dict:
    result = {}
    for key, value in d.items():
        target = result
        for k in key[:-1]:  # traverse all keys but the last
            target = target.setdefault(k, {})
        target[key[-1]] = value
    return result

In [55]:
def df_to_nested_dict(df: pd.DataFrame) -> dict:
    d = df.to_dict(orient='index')
    data = {k: nest(v) for k, v in d.items()}
    text_file.write(json.dumps(data))

In [56]:
df_to_nested_dict(new_df)